export const articleList = {
    "berzhuan1":"ber传 ep.1"
}
export const articleIntroduction = {
    "berzhuan":"。。。"
}

export const funList = {
    "SWD" : "SWD",
    "suoweide" : "所谓的",
    //"embmq" : "耳膜爆鸣器",
    //"zlyb" : "再来一遍"
}
export const funIntroduction = {
    "SWD" : [
        ["介绍","。。。"]
    ],
    "suoweide" : [
		["...","..."]
    ]
}

export const personList = {
	"01": "孙榕谦",
	"02": "王一菡",
	"03": "高婧媛",
	"04": "郑子涵",
	"05": "谭博元",
	"06": "张润曦",
	"07": "王梓涵",
	"08": "张津铭",
	"09": "梁盛淇",
	"10": "房世轩",
	"11": "付百锋",
	"12": "陈玥妍",
	"13": "王一晴",
	"14": "刘潼硕",
	"15": "任和",
	"16": "武骏熙",
	"17": "祁贺然",
	"18": "毛子硕",
	"19": "尹暄博",
	"20": "李泽",
	"21": "郝晨希",
	"22": "隋昀希",
	"23": "蒋子航",
	"24": "王星然",
	"25": "孙望舒",
	"26": "董璨玮",
	"27": "魏源",
	"28": "崔伯约",
	"29": "贾开然",
	"30": "刘芊羽",
	"31": "赵一芳",
	"32": "朱烁瑾",
	"33": "安轩仪",
	"34": "王弈鸣",
	"35": "曹越",
	"36": "韩一铭",
	"37": "孙羽飞",
	"38": "陈柏旭",
	"39": "周香含",
	"40": "郑吉雯",
	"41": "闫爱晨",
	"42": "郑嘉懿",
	"43": "丁嘉妮",
	"44": "王文翰",
	"45": "赵俊浩",
	"46": "朱思涵",
	"47": "徐小乂",
	"48": "张未尘",
	"49": "乔曦霖",
	"50": "才昊冉",

    "jc": "",
    "jxy": "",
    "gb": "",
    "ls": "",
    "ltt": "",
    "zyt": "",
    "sff": "",
    "gy": "",
    "bx": "",
    "zhm": "",
    "bc": "",
    "cy": "",
    "lzj": "",
    "wzl": "",
    "zx": "",
    
    "yjk": "",
    "gxy": "",
    "xzq": "",
    "bsq": "",
};
export const personIntroduction = {
	"01": "...",
	"02": "...",
	"03": "...",
	"04": "...",
	"05": "...",
	"06": "...",
	"07": "...",
	"08": "...",
	"09": "...",
	"10": "...",
	"11": "...",
	"12": "...",
	"13": "...",
	"14": "...",
	"15": "...",
	"16": "...",
	"17": "...",
	"18": "...",
	"19": "...",
	"20": "...",
	"21": "...",
	"22": "...",
	"23": "...",
	"24": "...",
	"25": "...",
	"26": "...",
	"27": "...",
	"28": "...",
	"29": "...",
	"30": "...",
	"31": "...",
	"32": "...",
	"33": "...",
	"34": "...",
	"35": "...",
	"36": "...",
	"37": "...",
	"38": "...",
	"39": "...",
	"40": "...",
	"41": "...",
	"42": "...",
	"43": "...",
	"44": "...",
	"45": "...",
	"46": "...",
	"47": "...",
	"48": "...",
	"49": "...",
	"50": "...",

    "jc": "...",
    "jxy": "...",
    "gb": "...",
    "ls": "...",
    "ltt": "...",
    "zyt": "...",
    "sff": "...",
    "gy": "...",
    "bx": "...",
    "zhm": "...",
    "bc": "...",
    "cy": "...",
    "lzj": "...",
    "wzl": "...",
    "zx": "...",
    
    "yjk": "...",
    "gxy": "...",
    "xzq": "...",
    "bsq": "...",
};

export function prefixKeys(obj, str) {
	const keys = Object.keys(obj);
	for (const key of keys) {
		const value = obj[key];
		delete obj[key];
		obj[str + key] = value;
	}
}

prefixKeys(articleList,"Article.");
prefixKeys(articleIntroduction,"Article.");
prefixKeys(funList,"Fun.");
prefixKeys(funIntroduction,"Fun.");
prefixKeys(personList,"Person.");
prefixKeys(personIntroduction,"Person.");